Referntial intergity

In [1]:
import sqlite3

In [2]:
db5=sqlite3.connect("E:/MY SQLITE_database/student_course_database.db5")

In [3]:
cur=db5.cursor()

constraints`------------
unique -- enter only unique values, n duplicate values
not null---- no blank values can  be inserted in table

In [4]:
cur.execute("create table course(courseid int primary key, coursename text,duration int)")

In [5]:
cur.execute("create table student(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid) references courses(courseid))")

In [6]:
cur.execute("insert into course values(78,'Data Science',12),(56,'Python course',4),(101,'Database',7)")

print(cur.rowcount,"record(s) inserted")


db5.commit;

3 record(s) inserted

In [8]:
cur.execute("insert into student values(1,'Jack',22,78),(2,'John',21,78),(3,'Rudolf',18,78),(4,'Jim',25,56)")

print(cur.rowcount,"record(s) inserted ")

db5.commit;

4 record(s) inserted

In [12]:
results=cur.execute('select * from course')

results.fetchall()

[(78, 'Data Science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [13]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 78),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 25, 56)]

In [14]:
results=cur.execute('select courseid from course where coursename="Data Science"')

for i in results:
    print(i)

(78,)

# Subquery

In [15]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Data Science")')

results.fetchall()

[(1, 'Jack', 22, 78), (2, 'John', 21, 78), (3, 'Rudolf', 18, 78)]

In [24]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename ="Python course")')


results.fetchall()

[(4, 'Jim', 25, 56)]

# JOIN

# INNER JOIN

In [1]:
import sqlite3

In [2]:
con=sqlite3.connect("E:/MY SQLITE_DATABASE/emp_database.db")

In [3]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key, name text, salary real,department text, position text,hiredate date)")
    con.commit()

In [4]:
#calling function

sql_table(con)

In [5]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Jack',9000,'HR','Manager','2019-07-06')")

In [6]:
con.commit()

In [7]:
results=cur.execute("select *from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-06')]

In [8]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee (id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)

In [9]:
entities=(2,'Andrew',6000,'IT','Engineer','2021-08-09')

In [10]:
sql_insert(con,entities)

In [11]:
entities=(3,'John',7000,'Sales','manager','2021-09-07')
sql_insert(con,entities)


results=cur.execute("select*from employee")

results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-06'),
 (2, 'Andrew', 6000.0, 'IT', 'Engineer', '2021-08-09'),
 (3, 'John', 7000.0, 'Sales', 'manager', '2021-09-07')]

In [12]:
results=cur.execute("select*from employee")

results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-06'),
 (2, 'Andrew', 6000.0, 'IT', 'Engineer', '2021-08-09'),
 (3, 'John', 7000.0, 'Sales', 'manager', '2021-09-07')]

In [13]:
entities=(4,'Rudolf',10000,'IT','engineer','2021-09-23')

sql_insert(con,entities)

entities=(5,'Heera',11000,'Sales','executive','2020-11-23')

sql_insert(con,entities)

In [14]:
results=cur.execute('select*from employee')
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-06'),
 (2, 'Andrew', 6000.0, 'IT', 'Engineer', '2021-08-09'),
 (3, 'John', 7000.0, 'Sales', 'manager', '2021-09-07'),
 (4, 'Rudolf', 10000.0, 'IT', 'engineer', '2021-09-23'),
 (5, 'Heera', 11000.0, 'Sales', 'executive', '2020-11-23')]

In [18]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name ="Martin" where id=1')
    con.commit()

In [19]:
sql_update(con)

In [20]:
results=cur.execute("select *from employee")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-06'),
 (2, 'Andrew', 6000.0, 'IT', 'Engineer', '2021-08-09'),
 (3, 'John', 7000.0, 'Sales', 'manager', '2021-09-07'),
 (4, 'Rudolf', 10000.0, 'IT', 'engineer', '2021-09-23'),
 (5, 'Heera', 11000.0, 'Sales', 'executive', '2020-11-23')]

In [21]:
results=cur.execute("select id, name from employee")
results.fetchall()

[(1, 'Martin'), (2, 'Andrew'), (3, 'John'), (4, 'Rudolf'), (5, 'Heera')]

In [26]:
results=cur.execute("select id ,name from employee where department is ('HR')")


results.fetchall()

[(1, 'Martin')]

In [28]:
results=cur.execute("select id ,name from employee where salary >8000")


results.fetchall()

[(1, 'Martin'), (4, 'Rudolf'), (5, 'Heera')]

In [29]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(6000.0,)]

In [30]:
results=cur.execute("select max(salary) from employee")
results.fetchall()

[(11000.0,)]

In [31]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(5,)]

In [32]:
results=cur.execute("select distinct (department) from employee")

results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [34]:
results=cur.execute("select sum(salary),position from employee group by position")

results.fetchall()

[(6000.0, 'Engineer'),
 (9000.0, 'Manager'),
 (10000.0, 'engineer'),
 (11000.0, 'executive'),
 (7000.0, 'manager')]

In [37]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [38]:
#make query

sql="select * from employee"

#pass query in function

respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-06'),
 (2, 'Andrew', 6000.0, 'IT', 'Engineer', '2021-08-09'),
 (3, 'John', 7000.0, 'Sales', 'manager', '2021-09-07'),
 (4, 'Rudolf', 10000.0, 'IT', 'engineer', '2021-09-23'),
 (5, 'Heera', 11000.0, 'Sales', 'executive', '2020-11-23')]